Revit 2027 API
ParameterTypeId.ViewSolarstudyMultidayPresetIndex Property
 "Multi-day presets combo"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ViewSolarstudyMultidayPresetIndex { get; }
Public Shared ReadOnly Property ViewSolarstudyMultidayPresetIndex As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ViewSolarstudyMultidayPresetIndex {
	ForgeTypeId^ get ();
}
static member ViewSolarstudyMultidayPresetIndex : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace